geobee-backend/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "states_games".* FROM "states_games" ORDER BY "states_games"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    def show
        user = User.find(params['id'])

        user_games = user.states_games
        user_results_obj = {}

        user_games.each do |i|

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "jim"], ["created_at", "2021-01-28 01:20:33.154715"], ["updated_at", "2021-01-28 01:20:33.154715"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "rachel"], ["LIMIT", 1]]
---
    def create
        user = User.find_or_create_by(username: user_params["username"])